/*
 * @lc app=leetcode.cn id=233 lang=java
 *
 * [233] 数字 1 的个数
 */

// @lc code=start
class Solution {
    /**
        [1--9]--> 1
        [10--19] --> 11
        [20--29] --> 1
        [30--39] --> 1
        ....
        [90--99] --> 1
        [100--199] --> 100 + count(99) 
        [200-299] ---> count(99) 
        ....
        [900-999] ---> count(99)
        [1000-1999]  -> 1000 + count(999) // 首先千位数上一直都是1， 所以这里有1000个1， 然后在个位，十位和百位上的1就是count(999)
        [2000-2999] --> count(999) 
        [3000-3999] --> count(999) 
        ... 
        [9000-9999] --> count(999)
    */
    public int countDigitOne(int n) {
        
    }
}
// @lc code=end

